tap "aws/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "indigo-ag/dev-core", "git@github.com:indigo-ag/homebrew-dev-core.git"
tap "lucagrulla/tap"
tap "versent/taps"
brew "bzip2"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bat"
brew "glib"
brew "cairo"
brew "chamber"
brew "circleci"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "credstash"
brew "libidn2"
brew "libssh2"
brew "rtmpdump"
brew "deno"
brew "libevent"
brew "folly"
brew "exa"
brew "libtool"
brew "guile"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "little-cms2"
brew "libass"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "gcc"
brew "libdap"
brew "nss"
brew "numpy"
brew "poppler"
brew "gdal"
brew "git"
brew "git-extras"
brew "go"
brew "gobject-introspection"
brew "gource"
brew "jq"
brew "mkcert"
brew "neovim"
brew "nghttp2"
brew "nginx"
brew "nvm"
brew "opa"
brew "openssl@3"
brew "pgcli"
brew "php"
brew "pkcs11-helper"
brew "poppler-qt5"
brew "pyenv"
brew "pyenv-virtualenv"
brew "tcl-tk"
brew "python@3.8"
brew "python@3.9"
brew "ripgrep"
brew "shellcheck"
brew "sphinx-doc"
brew "telnet"
brew "tfenv"
brew "tflint"
brew "tmux"
brew "tree"
brew "watchman"
brew "wimlib"
brew "zenith"
brew "zlib"
brew "zsh"
brew "aws/tap/aws-sam-cli"
brew "heroku/brew/heroku"
brew "indigo-ag/dev-core/dev-cli"
brew "lucagrulla/tap/cw"
brew "versent/taps/saml2aws"
cask "aws-vpn-client"
cask "docker"
cask "flixtools"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "ngrok"
cask "sdm"
cask "slack"
cask "vlc"
cask "whatsapp"
cask "zoom"
