# Third-Party Repositories
tap "aws/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "lucagrulla/tap"

# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Modern replacement for 'ls'
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Lightweight and flexible command-line JSON processor
brew "jq"
# The best way to tail AWS Cloudwatch Logs from your terminal
brew "lucagrulla/tap/cw"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# General-purpose scripting language
brew "php"
# Library to simplify the interaction with PKCS#11
brew "pkcs11-helper"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# User interface to the TELNET protocol
brew "telnet"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# In terminal graphical metrics for your *nix system
brew "zenith"
# UNIX shell (command interpreter)
brew "zsh"

#### Casks
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Pack, ship and run any application as a lightweight container
cask "docker"
# Strongdm client
cask "sdm"
# Managed client-based VPN service to securely access AWS resources
cask "aws-vpn-client"
# Team communication and collaboration software
cask "slack"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
# Multimedia player
cask "vlc"
# Downloads subtitles for movies
cask "flixtools"
